In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn
import math

In [2]:
df = pd.read_csv('D:/Desktop/DataMining/new_Basket_2_2009.csv', sep=',')
df

,Country,Customer ID,Description,Invoice,InvoiceDate,Price,Quantity,StockCode
0,United Kingdom,13085.0,15CM CHRISTMAS GLASS BALL 20 LIGHTS,489434,2009-01-12 07:45:00,6.95,12,85048
1,United Kingdom,13085.0,PINK CHERRY LIGHTS,489434,2009-01-12 07:45:00,6.75,12,79323P
2,United Kingdom,13085.0,WHITE CHERRY LIGHTS,489434,2009-01-12 07:45:00,6.75,12,79323W
3,United Kingdom,13085.0,STRAWBERRY CERAMIC TRINKET BOX,489434,2009-01-12 07:45:00,1.25,24,21232
4,United Kingdom,13085.0,PINK DOUGHNUT TRINKET POT,489434,2009-01-12 07:45:00,1.65,24,22064
...,...,...,...,...,...,...,...,...
37402,United Kingdom,17867.0,REX CASH+CARRY JUMBO SHOPPER,493407,2009-12-23 16:04:00,0.95,10,21034
37403,United Kingdom,17841.0,CRYSTAL STUD EARRINGS ASSORTED COL,493408,2009-12-23 16:21:00,0.38,1,90058B
37404,United Kingdom,17841.0,PINK VINTAGE PAISLEY PICNIC BAG,493408,2009-12-23 16:21:00,2.95,1,21933
37405,United Kingdom,17841.0,STRAWBERRY PICNIC BAG,493408,2009-12-23 16:21:00,2.95,1,21937
37406,United Kingdom,17841.0,RED/WHITE SPOT PICNIC BAG,493408,2009-12-23 16:21:00,2.95,1,21936

In [3]:
#number of distinct session for Customer 
Nsessions = df.groupby('Customer ID')['Invoice'].nunique().reset_index()
Nsessions.columns = ['Customer ID', 'Nsessions']
Nsessions

     Customer ID  Nsessions
0        12346.0          5
1        12358.0          1
2        12359.0          2
3        12417.0          2
4        12422.0          1
..           ...        ...
904      18268.0          1
905      18271.0          1
906      18275.0          1
907      18276.0          1
908      18286.0          1

[909 rows x 2 columns]

In [4]:
df = df.astype({'Price': 'float'})

In [5]:
#Tot spent for customer in the period of osservation
TotSpent = df.groupby('Customer ID', as_index=False)['Price'].sum()
TotSpent.columns = ['Customer ID', 'TotSpent']
TotSpent

     Customer ID  TotSpent
0        12346.0     19.00
1        12358.0     35.89
2        12359.0     97.14
3        12417.0     47.15
4        12422.0      6.65
..           ...       ...
904      18268.0     37.17
905      18271.0     26.55
906      18275.0     20.65
907      18276.0     24.70
908      18286.0     50.00

[909 rows x 2 columns]

In [6]:
#Avg spent for customer in a session
avgSpent = df.groupby(['Customer ID', 'Invoice'], as_index=False)['Price'].sum()[['Customer ID', 'Price']].groupby('Customer ID', as_index=False)['Price'].mean()
avgSpent.columns = ['Customer ID', 'avgSpent']
avgSpent

     Customer ID  avgSpent
0        12346.0     3.800
1        12358.0    35.890
2        12359.0    48.570
3        12417.0    23.575
4        12422.0     6.650
..           ...       ...
904      18268.0    37.170
905      18271.0    26.550
906      18275.0    20.650
907      18276.0    24.700
908      18286.0    50.000

[909 rows x 2 columns]

In [7]:
#Maximum spent by a customer in a Session
Max = df.groupby(['Customer ID', 'Invoice'], as_index=False)['Price'].sum()[['Customer ID', 'Price']].groupby('Customer ID', as_index=False)['Price'].max()
Max.columns = ['Customer ID', 'Max']
Max

     Customer ID    Max
0        12346.0   4.50
1        12358.0  35.89
2        12359.0  96.29
3        12417.0  46.30
4        12422.0   6.65
..           ...    ...
904      18268.0  37.17
905      18271.0  26.55
906      18275.0  20.65
907      18276.0  24.70
908      18286.0  50.00

[909 rows x 2 columns]

In [8]:
#Minimum spent by a customer in a Session
Min = df.groupby(['Customer ID', 'Invoice'], as_index=False)['Price'].sum()[['Customer ID', 'Price']].groupby('Customer ID', as_index=False)['Price'].min()
Min.columns = ['Customer ID', 'Min']
Min

     Customer ID    Min
0        12346.0   1.00
1        12358.0  35.89
2        12359.0   0.85
3        12417.0   0.85
4        12422.0   6.65
..           ...    ...
904      18268.0  37.17
905      18271.0  26.55
906      18275.0  20.65
907      18276.0  24.70
908      18286.0  50.00

[909 rows x 2 columns]

In [9]:
#Number of distinct item for customer
DistinctItem = df.groupby('Customer ID')['StockCode'].nunique().reset_index()
DistinctItem.columns = ['Customer ID', 'DistinctItem']
DistinctItem

     Customer ID  DistinctItem
0        12346.0             2
1        12358.0             9
2        12359.0            28
3        12417.0            17
4        12422.0             5
..           ...           ...
904      18268.0            12
905      18271.0             8
906      18275.0             7
907      18276.0            15
908      18286.0            14

[909 rows x 2 columns]

In [10]:
#Tot item for each customer
TotItem = df.groupby('Customer ID', as_index=False)['Quantity'].sum()
TotItem.columns = ['Customer ID', 'TotItem']
TotItem

     Customer ID  TotItem
0        12346.0       26
1        12358.0       91
2        12359.0      194
3        12417.0      149
4        12422.0       60
..           ...      ...
904      18268.0      142
905      18271.0       44
906      18275.0      128
907      18276.0      192
908      18286.0      108

[909 rows x 2 columns]

In [11]:
#New Dataset
Customer_2009 =TotItem.merge(avgSpent, on='Customer ID').merge(Nsessions, on='Customer ID').merge(TotSpent, on='Customer ID').merge(Max, on='Customer ID').merge(Min, on='Customer ID').merge(DistinctItem, on='Customer ID').set_index('Customer ID')

In [12]:
Customer_2009

,TotItem,avgSpent,Nsessions,TotSpent,Max,Min,DistinctItem
Customer ID,,,,,,,
12346.0,26,3.800,5,19.00,4.50,1.00,2
12358.0,91,35.890,1,35.89,35.89,35.89,9
12359.0,194,48.570,2,97.14,96.29,0.85,28
12417.0,149,23.575,2,47.15,46.30,0.85,17
12422.0,60,6.650,1,6.65,6.65,6.65,5
...,...,...,...,...,...,...,...
18268.0,142,37.170,1,37.17,37.17,37.17,12
18271.0,44,26.550,1,26.55,26.55,26.55,8
18275.0,128,20.650,1,20.65,20.65,20.65,7
18276.0,192,24.700,1,24.70,24.70,24.70,15
18286.0,108,50.000,1,50.00,50.00,50.00,14

In [13]:
df=Customer_2009

In [14]:
df

,TotItem,avgSpent,Nsessions,TotSpent,Max,Min,DistinctItem
Customer ID,,,,,,,
12346.0,26,3.800,5,19.00,4.50,1.00,2
12358.0,91,35.890,1,35.89,35.89,35.89,9
12359.0,194,48.570,2,97.14,96.29,0.85,28
12417.0,149,23.575,2,47.15,46.30,0.85,17
12422.0,60,6.650,1,6.65,6.65,6.65,5
...,...,...,...,...,...,...,...
18268.0,142,37.170,1,37.17,37.17,37.17,12
18271.0,44,26.550,1,26.55,26.55,26.55,8
18275.0,128,20.650,1,20.65,20.65,20.65,7
18276.0,192,24.700,1,24.70,24.70,24.70,15
18286.0,108,50.000,1,50.00,50.00,50.00,14

In [15]:
df.to_csv('D:/Desktop/DataMining/Customer_2009.csv')